# Типы данных:
# Список
print("Список <class 'list'> - тип данных, пишется в квадратных скобках:")
a = [1, 2, 3, 4, True, 'hello']
print(type(a))
print(a)
print('==========================================================================')

# в Список можно добавить значения, нажать букву а с точкой:
print("Добавление элемента в Список a.append('welcome')")
a.append('welcome')
print(a)
print('==========================================================================')

# Кортеж
print("Кортеж <class 'tuple'> - тип данных, неизменяемый Список, пишется в круглых скобках:")
b = (1, 2, 3, 4)
print(type(b))
print(b)
print('==========================================================================')

# Словарь <class 'dict'> состоит из ключа и  значения c = {'key': 5, 'key2': 6}
print("Словарь <class 'dict'> состоит из ключа и  значения c = {'key': 5, 'key2': 6}")
c = {'key': 5, 'key2': 6}
print(type(c))
print(c)
print('=========================================================================')

# Множество <class 'set'> - тип данных, отличается тем, что не хранит одинаковые значения
print("Множество <class 'set'> - тип данных, отличается тем, что не хранит одинаковые значения")
d = {1, 2, 3}
print(type(d))
print(d)






